Identifier: com.github.autopkg.wardsparadox.download.Ghostty
Description: Downloads the latest version of Ghostty.
Comment: Originally created by @discentem, ownership transferred

Input:
  NAME: Ghostty
MinimumVersion: "2.3"
Process:
  - Processor: URLTextSearcher
    Arguments:
      url: https://ghostty.org/download
      re_pattern: 'https:\/\/release\.files\.ghostty\.org\/\d+\.\d+\.\d+\/Ghostty\.dmg'
  - Processor: URLDownloader
    Arguments:
      url: "%match%"
  - Processor: EndOfCheckPhase
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Ghostty.app"
      requirement: 'identifier "com.mitchellh.ghostty" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "24VZTF6M5V"'
  - Processor: Versioner
    Arguments:
      input_plist_path: "%pathname%/Ghostty.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString
